announcements/tune-in-radio.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Internet Radio: Tune-In For Emacspeak</title>
<!-- 2015-02-17 Tue 16:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Internet Radio: Tune-In For Emacspeak</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Internet Radio: Tune-In For Emacspeak</h2>
<div class="outline-text-2" id="text-1">
<p>
I just checked in  the  ability to browse, search and play
radio-stations from TuneIn  on the Emacspeak Audio Desktop.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Pre-Requisites</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>xsltproc for xsl stylesheet processing.
</li>
<li>Linux mplayer for playing streams, preferably the latest version
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Simple Usage Summary</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>M-x emacspeak-wizards-tune-in-radio-browse brings up  the
browse interface.
</li>
<li>M-x emacspeak-wizards-tune-in-radio-search prompts for a
query and brings up search results.
</li>
<li>Both <i>browse</i> and <i>search</i> get the results back as an <span class="underline">OPML</span>
feed, which gets displayed as a simple Web page within the
Emacs Web Browser (EWW if using 24.4).
</li>
<li>Items identified as (link) are themselves <span class="underline">OPML</span> feeds and
can be opened via command emacspeak-feeds-opml-display.
</li>
<li>The initial browse buffer is set up to use opml-display
when you click on link items.
</li>
<li>You can play (audio) links by invoking command
<span class="underline">emacspeak-webutils-play-media-at-point &#x2014; this command is
bound to _;</span> in  EWW.
</li>
<li>You need to provide an interactive prefix argument to the
above command to indicate that it is a playlist &#x2014; so you
actually press <span class="underline">C-u ;</span> on audio links.
</li>
<li>Many of the audio links do not return a playlist &#x2013; they
instead return a link that is a pointer to a playlist. Newer
versions of <span class="underline">mplayer</span> will throw a security error &#x2014; you can
tell <span class="underline">mplayer</span> to follow them by invoking the earlier command
with two prefix args so <span class="underline">C-u C-u ;</span>.
</li>
<li>All this works about 90% of the time. In some cases &#x2013;
depending on whether the server failed to generate the right
</li>
</ul>
<p>
mimetype for the play URL etc, you may need to run
</p>
<pre class="example">
curl --silent &lt;url&gt; 
</pre>
<p>
where &lt;url&gt; is the URL of the audio link, then  pass that
resulting URL to command <span class="underline">emacspeak-m-player-url</span>.
</p>

<p>
Share And Enjoy!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-02-17 Tue&gt;</span></span></p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2015-02-17 Tue 16:41</p>
<p class="creator">Emacs 25.0.50.1 (Org mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
